In [55]:
#Reading and writing data

In [56]:
import os
import pandas as pd
import html5lib

In [57]:
os.getcwd()

'/Users/victormorenorequena/Desktop/Python_Youtube'

In [58]:
#os.chdir("/")

In [59]:
os.listdir("/Users/victormorenorequena/Desktop/Python_Youtube")

['Moreno_1_2.xlsx',
 '04_lists.ipynb',
 '.DS_Store',
 '06_Dictionaries_and_Sets.ipynb',
 '02_Basic_Data_Types.ipynb',
 '05_Tuples_and_Strings.ipynb',
 '09_Reading_and_Writing_Data.ipynb',
 '03_Variables.ipynb',
 '07_Numpy_Arrays.ipynb',
 '01_Python_Arithmetic.ipynb',
 'titanic',
 '08_Pandas_dataframe.ipynb',
 '~$Moreno_1_2.xlsx']

In [60]:
#Read CSV and TSV

In [61]:
titanic_train = pd.read_csv("/Users/victormorenorequena/Desktop/Python_Youtube/titanic/train.csv")
titanic_train.head(6)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [62]:
#To read TSV: pd.read_table()

In [63]:
vinos = pd.read_excel("/Users/victormorenorequena/Desktop/Python_Youtube/Moreno_1_2.xlsx"),
sheet_name = "Vinos"

vinos

(     Venta_ID  Vino_ID  Tienda_ID  Trab_ID  Plato_ID  Dia_ID
 0           1     31.0        1.0      NaN       6.0   402.0
 1           2      NaN        1.0      NaN      25.0   402.0
 2           3      NaN        1.0      NaN      43.0   402.0
 3           4      NaN        1.0      NaN       8.0   402.0
 4           5      NaN        1.0      NaN       9.0   402.0
 ..        ...      ...        ...      ...       ...     ...
 915       916      NaN        NaN      NaN       NaN     NaN
 916       917      NaN        NaN      NaN       NaN     NaN
 917       918      NaN        NaN      NaN       NaN     NaN
 918       919      NaN        NaN      NaN       NaN     NaN
 919       920      NaN        NaN      NaN       NaN     NaN

 [920 rows x 6 columns],)